back-end/app/controllers/api/v1/recipes_controller.rb

  def create
  @recipe = Recipe.new(recipe_params)
    if @recipe.save
---
INSERT INTO "recipes" ("name", "recipe_type", "difficulty", "cook_time", "ingredients", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Brigadeiro"], ["updated_at", "2019-09-09 00:20:11.934685"], ["id", 1]]

  def find_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]